Autodesk.Revit.DB.KeyBasedTreeEntry.GetChildrenKeys
Gets a collection containing the keys of all children entry objects from this entry.
Remarks:
To look up the entry object corresponding to the child keys using KeyBasedTreeEntries.FindEntry().
Returns:
The collection containing the keys of all children entry objects from this entry.
Since:
2015

Autodesk.Revit.DB.KeyBasedTreeEntry.IsValidObject
Specifies whether the .NET object represents a valid Revit entity.
Remarks:
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.
Returns:
True if the API object holds a valid Revit native object, false otherwise.
Since:
2014

Autodesk.Revit.DB.KeyBasedTreeEntry.ParentKey
The parent key of this entry.
Remarks:
This value will be the empty string if this entry does not have a parent.
Since:
2015

Autodesk.Revit.DB.KeyBasedTreeEntry.Key
The key of this entry.
Remarks:
This value will be used to do retrieval, sort and comparison.
This value should not be empty.
Since:
2015

Autodesk.Revit.DB.KeyBasedTreeEntry
A key-based tree entry, containing the key, parent key, and children keys (if applicable).
Since:
2015